In [10]:
import pandas as pd

In [11]:
data={
    'City':['NewYork','lose Angels','chicago','Newyork','chicago'],
    'Education':['Bachlor','Master','PhD','Master','Bachler']
}

In [12]:
df=pd.DataFrame(data)
df

          City Education
0      NewYork   Bachlor
1  lose Angels    Master
2      chicago       PhD
3      Newyork    Master
4      chicago   Bachler

In [13]:
encoder=pd.get_dummies(df,columns=['City','Education'],drop_first=True)

In [14]:
encoder

,City_Newyork,City_chicago,City_lose Angels,Education_Bachlor,Education_Master,Education_PhD
0,False,False,False,True,False,False
1,False,False,True,False,True,False
2,False,True,False,False,False,True
3,True,False,False,False,True,False
4,False,True,False,False,False,False